---
kind: type
id: T:Autodesk.Revit.DB.DoubleArrayIterator
source: html/29cad534-21a2-82c0-2859-0279f3367166.htm
---
# Autodesk.Revit.DB.DoubleArrayIterator

An iterator to an array of doubles.

## Syntax (C#)
```csharp
public abstract class DoubleArrayIterator : APIObject,
	IEnumerator
```